<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication
    |--------------------------------------------------------------------------
    */

    'auth' => [
        'sms_sent'           => 'کد تأیید با موفقیت ارسال شد.',
        'wait_two_minutes'   => 'لطفاً دو دقیقه دیگر دوباره تلاش کنید.',
        'user_registered'    => 'کاربر قبلاً ثب ت‌نام کرده است.',
        'new_user_created'   => 'کاربر جدید با موفقیت ایجاد شد.',
        'invalid_code'       => 'کد تأیید نامعتبر است.',
        'unauthorized'       => 'احراز هویت نامعتبر است.',
        'logout'             => 'با موفقیت از حساب خارج شدید.',

        // custom
        'send_sms_success'        => 'کد تأیید با موفقیت ارسال شد.',
        'send_sms_error'          => 'امکان ارسال مجدد کد تا ۲ دقیقه وجود ندارد.',
        'verify_sms_success'      => 'ورود با موفقیت انجام شد.',
        'verify_sms_error'        => 'کد وارد شده مطابق ندارد . دوباره سعی کنید',

        'register'             => 'کاربر با موفقیت وارد شد.',
        'profile'             => 'مشخصات کاربر',
    ],

    /*
    |--------------------------------------------------------------------------
    | Products
    |--------------------------------------------------------------------------
    */

    'products' => [
        'application_page' => 'اطلاعات صفحه محصولات با موفقیت دریافت شد.',
        'created'          => 'محصول با موفقیت ایجاد شد.',
        'updated'          => 'محصول با موفقیت ویرایش شد.',
        'deleted'          => 'محصول با موفقیت حذف شد.',


        // custom
        'most_sold_products'      => 'پرفروش‌ ترین محصولات',
        'most_viewed_products'    => 'پربازدیدترین محصولات',
        'newest_products'         => 'جدیدترین محصولات',
        'cheapest_products'       => 'ارزان‌ترین محصولات',
        'most_expensive_products' => 'گران‌ترین محصولات',
        'biggest_discount'        => 'محصولات با بیشترین تخفیف',
        'products_by_category'    => 'محصولات بر اساس دسته‌بندی',
        'products_by_brand'       => 'محصولات بر اساس برند',
        'products_details'        => 'جزئیات محصول',

        'save_product_comment' => 'نظر شما با موفقیت ثبت شد و پس از بررسی منتشر خواهد شد.',
        'search_product'          => 'نتایج جستجوی محصولات با موفقیت دریافت شد.',

        'home'                    => 'اطلاعات صفحه اصلی',
        'received_orders'         => 'مشخصات سفارشات',
    ],

    /*
    |--------------------------------------------------------------------------
    | Basket
    |--------------------------------------------------------------------------
    */

    'basket' => [
        'added'            => 'محصول به سبد خرید اضافه شد.',
        'already_exists'   => 'این محصول قبلاً در سبد خرید وجود دارد.',
        'removed'          => 'محصول از سبد خرید حذف شد.',
    ],

    /*
    |--------------------------------------------------------------------------
    | General
    |--------------------------------------------------------------------------
    */

    'general' => [
        'success' => 'عملیات با موفقیت انجام شد.',
        'error'   => 'خطایی رخ داده است.',
    ],


    'color' => [
        'index' => 'لیست رنگ ها',
        'store' => 'رنگ با موفقیت ایجاد شد.',
        'show' => 'نمایش رنگ مورد نظر',
        'update' => 'رنگ با موفقیت ویرایش شد.',
        'destroy' => 'حذف رنگ',
    ],
];
