<?php

return [

//   admin
    'brand' => [
        'created' => 'برند با موفقیت ثبت شد.',
        'updated' => 'برند با موفقیت ویرایش شد.',
        'deleted' => 'برند با موفقیت حذف شد.',
    ],

    'category' => [
        'created' => 'دسته بندی با موفقیت ثبت شد.',
        'updated' => 'دسته بندی با موفقیت ویرایش شد.',
        'deleted' => 'دسته بندی با موفقیت حذف شد.',
    ],

    'color' => [
        'created' => 'رنگ با موفقیت ثبت شد.',
        'updated' => 'رنگ با موفقیت ویرایش شد.',
        'deleted' => 'رنگ با موفقیت حذف شد.',
    ],

    'comment' => [
        'accepted' => 'نظر با موفقیت تایید شد.',
        'rejected' => 'نظر با موفقیت رد شد.',
        'deleted' => 'نظر با موفقیت حذف شد.',
        'submitted' => 'نظر شما بعد از تایید مدیر سایت نمایش داده میشود',
        'reply_created' => 'پاسخ ثبت شد.',
    ],

    'gallery' => [
        'created' => 'تصویر محصول با موفقیت ثبت شد.',
        'updated' => 'تصویر محصول با موفقیت ویرایش شد.',
        'deleted' => 'تصویر محصول با موفقیت حذف شد.',
    ],

    'product' => [
        'created' => 'محصول با موفقیت ثبت شد.',
        'updated' => 'محصول با موفقیت ویرایش شد.',
        'deleted' => 'محصول با موفقیت حذف شد.',
    ],

    'property' => [
        'created' => 'ویژگی با موفقیت ثبت شد.',
        'updated' => 'ویژگی با موفقیت ویرایش شد.',
        'deleted' => 'ویژگی با موفقیت حذف شد.',
    ],

    'property_groups' => [
        'created' => 'گروه ویژگی با موفقیت ثبت شد.',
        'updated' => 'گروه ویژگی با موفقیت ویرایش شد.',
        'deleted' => 'گروه ویژگی با موفقیت حذف شد.',
    ],

    'role' => [
        'created' => 'نقش با موفقیت ثبت شد.',
        'updated' => 'نقش با موفقیت ویرایش شد.',
        'deleted' => 'نقش با موفقیت حذف شد.',
    ],

    'slider' => [
        'created' => 'اسلایدر با موفقیت ثبت شد.',
        'updated' => 'اسلایدر با موفقیت ویرایش شد.',
        'deleted' => 'اسلایدر با موفقیت حذف شد.',
    ],

    'user' => [
        'created' => 'کاربر با موفقیت ثبت شد.',
        'updated' => 'کاربر با موفقیت ویرایش شد.',
        'deleted' => 'کاربر با موفقیت حذف شد.',
        'created_role' => 'نقش های کاربر با موفقیت ذخیره شد',
    ],

    'basket' => [
        'added'   => 'محصول به سبد خرید اضافه شد.',
        'exist'   => 'این محصول در سبد خرید شما موجود است.',
        'deleted' => '.محصول از سبد خرید حذف شد',
        'empty'   => 'سبد خرید شما خالی است.',
    ],



//   auth
    'auth' => [
        'login'    => 'با موفقیت وارد شدید.',
        'failed'    => 'شماره موبایل یا رمز عبور اشتباه وارد شده.',
        'exist'    => 'کاربر از قبل وجود دارد.',
        'created'  => 'کاربر با موفقیت ایجاد شد.',
        'password' => 'رمز عبور و تکرار رمز عبور یکسان نیست.',
        'logout'   => 'با موفقیت خارج شدید.',
    ],

    'address' => [
        'created'   => 'آدرس کاربر با موفقیت ثبت شد',
        'required'  => 'ابتدا آدرس خود را ثبت کنید.',
    ],

    'contact' => [
        'created' => 'پیام شما با موفقیت ثبت شد. در اولین فرصت با شما تماس خواهیم گرفت.',
        'read' => 'پیام بررسی شد.',
    ],

    'account' => [
        'completed' => 'عالی! اطلاعات حساب شما با موفقیت ثبت و تکمیل شد.',
    ],
];

